Tekla.Structures.Filtering.NumericOperatorType
The numeric operator type defines the operators between two numeric filter expressions.

Tekla.Structures.Filtering.NumericOperatorType.IS_EQUAL
The "is equal" operator.

Tekla.Structures.Filtering.NumericOperatorType.IS_NOT_EQUAL
The "is not equal" operator.

Tekla.Structures.Filtering.NumericOperatorType.SMALLER_THAN
The "smaller than" operator.

Tekla.Structures.Filtering.NumericOperatorType.SMALLER_OR_EQUAL
The "smaller or equal" operator.

Tekla.Structures.Filtering.NumericOperatorType.GREATER_THAN
The "greater than" operator.

Tekla.Structures.Filtering.NumericOperatorType.GREATER_OR_EQUAL
The "greater or equal" operator.